Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: When you see the list of issues grouped by type, you can apply quick-fixes to the whole scope.
zh_cn: 当您看到按类型分组的问题列表时，您可以将快速修复应用到整个范围。

source: When you use &shortcut:UpdateProject; (VCS | Update Project) to pull changes from VCS, you can choose whether you want to Merge your local changes or Rebase.
zh_cn: 当您使用 &shortcut:UpdateProject;(VCS | Update Project)从 VCS 中提取更改时，您可以选择是否要 Merge 您的本地更改或 Rebase。

source: When you want to add a condition around a code fragment in the editor, press &shortcut:SurroundWith; (Code | Surround With) and choose if...end or if...then...end.
zh_cn: 当您想在编辑器中的代码片段周围添加条件时，请按 &shortcut:SurroundWith;(Code | Surround With)并选择 if...end 或 if...then...end。

source: When you want to catch exceptions thrown by some code fragment, select it in the editor, press &shortcut:SurroundWith; (Code | Surround With) and choose try/except.
zh_cn: 当你想要捕获一些代码片段内抛出的异常时，在编辑器中选择，然后按下 &shortcut:SurroundWith; (Code | Surround With) 并选择 try/except。

source: When you want to catch exceptions thrown by some code fragment, select it in the editor, press &shortcut:SurroundWith; (Code | Surround With) and choose try / catch.
zh_cn: 当你想要捕获一些代码片段内抛出的异常时，在编辑器中选择，然后按下 &shortcut:SurroundWith; (Code | Surround With) 并选择 try / catch。

source: While debugging, you might need an interactive console at hand...
zh_cn: 在调试时，您可能需要一个交互式控制台...

source: While in the Find in Path dialog, you can switch to replace by pressing &shortcut:ReplaceInPath;.
zh_cn: 在 Find in Path 对话框中，你可以按 &shortcut:ReplaceInPath; 切换为替换。

source: While the key is pressed, the tool window buttons are visible.
zh_cn: 当按下该键时，工具窗口按钮是可见的。

source: Whitespace expected
zh_cn: 期望空白

source: Whole &project
zh_cn: 整个项目(&P)

source: Whole project
zh_cn: 整个项目

source: Whole project is inspected by default.
zh_cn: 默认情况下检查整个项目。

source: Whole wo&rds only (may be faster)
zh_cn: 全单词匹配(可能更快)(&R)

source: Whole words only
zh_cn: 仅整个字

source: Widescreen tool window layout
zh_cn: 宽屏工具窗口布局

source: Wildcard type ''{0}'' cannot be instantiated directly
zh_cn: 通配符类型 ''{0}'' 不能直接实例化

source: Wildcards may be used only as reference parameters
zh_cn: 通配符只能用作引用参数

source: Will be merged
zh_cn: 将被合并

source: Will be merged with conflicts
zh_cn: 将被合并冲突

source: Will be merged with property conflicts
zh_cn: 将被合并属性冲突

source: Will be merged with tree conflicts
zh_cn: 将被合并树冲突

source: Will be restored
zh_cn: 将被恢复

source: Window Options
zh_cn: 窗口选项

source: Window/unwindow active tool window
zh_cn: 窗口化/取消窗口化 活动工具窗口

source: With Block
zh_cn: 用块

source: With PhpStorm it is quite easy.
zh_cn: 使用 PhpStorm 这很容易。

source: With PyCharm it is quite easy.
zh_cn: 使用 PyCharm 这很容易。

source: With Subpackages
zh_cn: 以及子包

source: With a single keystroke, you can apply another code style/coloring scheme or keymap right from the editor.
zh_cn: 通过单次击键，您就可以从编辑器中应用另一种代码样式/颜色方案或快捷键设置。

source: With the caret at the class name in the editor, press &shortcut:ShowIntentionActions;, and choose Create Test from the suggestion list:
zh_cn: 将插入符号放到编辑器中的类名处，按下 &shortcut:ShowIntentionActions;，从建议列表中选择 Create Test 。

source: Within
zh_cn: 内部

source: Within Type Arguments
zh_cn: 在类型参数

source: Wo&rds
zh_cn: 按词(&R)

source: Working directory:
zh_cn: 工作目录：

source: Working in the interactive consoles, you don't need to memorise the command line syntax or available functions.
zh_cn: 在交互式控制台中工作，你不需要记住命令行语法或可用的功能。

source: Would you like remaining changes to be moved to another changelist?
zh_cn: 您是否希望将更改移动到另一个更改列表？

source: Would you like to associate it with a file type?
zh_cn: 您要将其与文件类型相关联吗？

source: Would you like to clear the list of recent projects?
zh_cn: 你想清除最近的项目列表吗?

source: Would you like to continue?</html>
zh_cn: 你想继续吗？</html>

source: Would you like to create a new subclass?
zh_cn: 你想创建一个新的子类吗？

source: Would you like to create a project from existing sources instead?
zh_cn: 你想从现有的源码创建一个项目吗？

source: Would you like to create the directories?
zh_cn: 是否要创建目录?

source: Would you like to create {0} project for the sources you have checked out to {1}?
zh_cn: 您要为已签出的来源 {1} 创建 {0} 项目吗？

source: Would you like to detach the {1, choice, 1#project|2#projects} {0}?
zh_cn: 你想分离项目 {0} 吗?

source: Would you like to download and install plugin ''{0}''?
zh_cn: 你想下载并安装插件 ''{0}'' 吗?

source: Would you like to ignore facet ''{0}'' from module ''{1}''?
zh_cn: 你想忽略模块 ''{1}'' 的 facet ''{0}'' 吗？

source: Would you like to mark the module content root "{0}" as a source directory?
zh_cn: 是否要将模块内容根 "{0}" 标记为源目录？

source: Would you like to move the files that failed to commit to a separate changelist?
zh_cn: 您要移动无法提交的文件到单独的更改列表吗？

source: Would you like to open the directory {0}?
zh_cn: 要打开目录 {0} 吗?

source: Would you like to open this project?
zh_cn: 你想打开这个项目吗？

source: Would you like to overwrite it?
zh_cn: 你想覆盖它吗？

source: Would you like to re-activate or shut down?
zh_cn: 您要重新激活还是关闭？

source: Would you like to reload changed classes anyway?
zh_cn: 你仍想重新加载修改过的类吗?

source: Would you like to reload project "{0}" now?
zh_cn: 你现在要重新加载项目 "{0}" 吗？

source: Would you like to remove module ''{0}'' from the project?
zh_cn: 您要从项目中移除模块 ''{0}'' 吗？

source: Would you like to replace default constructor of {0} with factory method?
zh_cn: 你想用工厂方法替换 {0} 的默认构造函数吗？

source: Would you like to replace {1,choice,1#it|2#them}?
zh_cn: 你想替换它{1,choice,1#|2#们}吗?

source: Would you like to rerun the search now?
zh_cn: 您想现在重新运行搜索吗?

source: Would you like to review and replace {1,choice,1#it|2#them}?
zh_cn: 您想要查看并替换 {1,choice,1#它|2#它们}吗?

source: Would you like to review them?
zh_cn: 你想回顾它们吗？

source: Would you like to save changes and finish merging?
zh_cn: 你想保存更改并完成合并吗？

source: Would you like to stop the search?
zh_cn: 你想停止搜索吗？

source: Would you like to update plugin ''{0}''?
zh_cn: 你想更新插件 ''{0}'' 吗?

source: Would you like to {0} the changes to {1} selected files?
zh_cn: 你想要 {0} 更改到 {1} 个所选文件吗?

source: Would you like to {0} the changes to {1}?
zh_cn: 您想 {0} 更改为 {1} 吗？

source: Wrap Expression
zh_cn: 包裹表达式

source: Wrap Method Re_turn Value...
zh_cn: 包装方法的返回值...(_T)

source: Wrap after modifier list
zh_cn: 在修饰符列表后面换行

source: Wrap always
zh_cn: 总是换行

source: Wrap at right margin
zh_cn: 在右边距换行

source: Wrap at word breaks
zh_cn: 分字换行

source: Wrap attributes:
zh_cn: 换行属性:

source: Wrap first call
zh_cn: 换行第一个调用

source: Wrap if long
zh_cn: 换行如果过长

source: Wrap if multiple
zh_cn: 多个时换行

source: Wrap on typing
zh_cn: 输入时换行

source: Wrap parameter using ''{0}''
zh_cn: 使用 ''{0}'' 包装参数

source: Wrap parameter using 'Math.toIntExact()'
zh_cn: 使用 'Math.toIntExact()' 包裹参数

source: Wrap parameter using 'new File()'
zh_cn: 使用 'new File()' 包装参数

source: Wrap return value of the specified method with object
zh_cn: 包装指定方法的返回值为对象

source: Wrap text
zh_cn: 文本换行

source: Wrap using ''{0}''
zh_cn: 使用 ''{0}'' 包装

source: Wrap using ''{0}()''
zh_cn: 使用 ''{0}()'' 包围

source: Wrap using 'Arrays.asList()'
zh_cn: 使用 'Arrays.asList()' 包裹

source: Wrap using 'Math.toIntExact()'
zh_cn: 使用 'Math.toIntExact()' 包裹

source: Wrap using 'java.util.Optional'
zh_cn: 用 'java.util.Optional' 包裹

source: Wrap using 'new File()'
zh_cn: 使用 'new File()' 包装

source: Wrap using adapter call or object
zh_cn: 使用适配器调用或对象包装

source: Wrap when typing reaches right margin
zh_cn: 当键入到右页边距的时候换行

source: Wrap {0, choice, 1#1st|2#2nd|3#3rd|4#{0,number}th} parameter using ''Arrays.asList()''
zh_cn: 使用 ''Arrays.asList()'' 包裹第 {0} 个参数

source: Wrap {0, choice, 1#1st|2#2nd|3#3rd|4#{0,number}th} parameter using ''Math.toIntExact()''
zh_cn: 使用 ''Math.toIntExact()'' 包裹第 {0,number} 个参数

source: Wrap {0, choice, 1#1st|2#2nd|3#3rd|4#{0,number}th} parameter using ''java.util.Optional''
zh_cn: 用 ''java.util.Optional'' 包裹第 {0,number} 个参数

source: Wrap {0, choice, 1#1st|2#2nd|3#3rd|4#{0,number}th} parameter using ''new File()''
zh_cn: 使用 ''new File()'' 包装第 {0} 个参数

source: Wrap {0, choice, 1#1st|2#2nd|3#3rd|4#{0,number}th} parameter using ''{1}''
zh_cn: 使用 ''{1}'' 包装第 {0} 个参数

source: Wrapping
zh_cn: 自动换行

source: Wrapping and Braces
zh_cn: 换行和括号

source: Write Error
zh_cn: 写错误

source: Wrong Changelist Name
zh_cn: 错误的更改列表名字

source: Wrong closing XML/xHTML tag
zh_cn: 错误的关闭 XML/xHTML 标签

source: Wrong closing tag name
zh_cn: 关闭标签名称错误

source: Wrong name
zh_cn: 错误的名字

source: Wrong name format: {0}
zh_cn: 错误的名称格式: {0}

source: Wrong name: {0}
zh_cn: 错误的名称:{0}

source: Wrong number of type arguments: {0}; required: {1}
zh_cn: 类型参数数量错误：{0};要求：{1}

source: Wrong package statement
zh_cn: 错误的包语句

source: Wrong return type: ''{0}''
zh_cn: 错误的返回类型:''{0}''

source: Wrong root element
zh_cn: 错误的根元素

source: Wrong tag value
zh_cn: 标签值错误

source: Wrong tag {0}
zh_cn: 错误的标签 {0}

source: Wrong type ''{0}'' for exception, should extend java.lang.Throwable
zh_cn: 错误的异常类型 ''{0}''，应继承 java.lang.Throwable

source: Wrong type: ''{0}'' for exception
zh_cn: 异常的错误类型:''{0}''

source: Wrong type: ''{0}'' for parameter ''{1}''
zh_cn: 参数 ''{1}'' 错误的类型:''{0}''

source: Wrong {0, choice, 1#1st|2#2nd|3#3rd|4#{0,number}th} argument type.
zh_cn: 错误的第 {0} 个参数类型。

source: Wrong {0} value
zh_cn: 错误 {0} 值

source: Wrong {0} value: ''{1}'' for parameter ''{2}''
zh_cn: 错误 {0} 值:''{1}'' 对于参数 ''{2}''

source: X - Experimental features
zh_cn: X - 实验功能

source: XDoclet metadata
zh_cn: XDoclet 元数据

source: XHTML files
zh_cn: XHTML 文件

source: XML Actions
zh_cn: XML 操作

source: XML Code Folding
zh_cn: XML 代码折叠

source: XML Document Type Definition
zh_cn: XML 文档类型定义

source: XML Editor
zh_cn: XML 编辑器

source: XML Generate Actions
zh_cn: XML 生成操作

source: XML file ''{0}'' is invalid
zh_cn: XML 文件 ''{0}'' 无效

source: XML files
zh_cn: XML 文件

source: XML highlighting
zh_cn: XML 高亮

source: XML name expected
zh_cn: 期望 XML 名称

source: XML name or entity ref expected
zh_cn: 期望 XML 名称或实体引用

source: XML tag
zh_cn: XML 标签

source: XML tag empty body
zh_cn: XML 标签空体

source: XML tag has empty body
zh_cn: XML 标记有空体

source: XML tags
zh_cn: XML 标签

source: XMLSchema design type
zh_cn: XML Schema 设计类型

source: XPath Viewer
zh_cn: XPath 查看器

source: XSL Text
zh_cn: XSL 文本

source: Xml declaration should precede all document content
zh_cn: Xml 声明应先于所有文档内容

source: YAML files
zh_cn: YAML 文件

source: Yes
zh_cn: 是

source: Yes for &All
zh_cn: 全是(&A)

source: Yesterday
zh_cn: 昨天

source: You already have the latest version of {0} and plugins installed.
zh_cn: 您已经安装了最新版本的 {0} 和插件。

source: You already have the latest version of {0} installed.
zh_cn: 您已经安装了最新版本的 {0}。

source: You are adding an action without icon to the toolbar.
zh_cn: 您正在将没有图标的操作添加到工具栏。

source: You are opening a file from a network share.
zh_cn: 您正在从网络共享中打开文件。

source: You are opening a project from a network share.
zh_cn: 您正在从网络共享中打开一个项目。

source: You can accept completion suggestions by pressing Tab instead of Enter.
zh_cn: 你可以按 Tab 而不用 Enter 来接受补全建议。

source: You can add a brief description of any breakpoint, to ease search in future.
zh_cn: 您可以添加任何断点的简要说明，以便日后轻松搜索。

source: You can also choose an item with {0}
zh_cn: 您也可以选择一个项目用 {0}

source: You can also choose an item with: {0}
zh_cn: 您也可以选择一个项目用: {0}

source: You can also click in the upper-right corner of the product window.
zh_cn: 您也可以点击产品窗口右上角的 。

source: You can also click the mouse on usages with the Ctrl key pressed to jump to declarations.
zh_cn: 你也可以按住 Ctrl 键，在使用处点击鼠标，即可跳转到定义处。

source: You can also click the mouse on usages with the Ctrl(Windows or *nix)/Cmd(MacOS) key pressed to jump to declarations.
zh_cn: 你也可以按住 Ctrl(Windows or *nix)/Cmd(MacOS) 键，在使用处点击鼠标，即可跳转到定义处。

source: You can also copy references in the GotoClass/GotoSymbol/GotoFile dialogs.
zh_cn: 你也可以在 GotoClass/GotoSymbol/GotoFile 对话框中复制引用。

source: You can also invoke the hierarchy view right from the editor to see the hierarchy for the currently edited class.
zh_cn: 您还可以在编辑器右侧显示层次结构视图，以查看当前编辑的类的层次结构。

source: You can also open a project or edit a file by drag and drop onto Welcome screen.
zh_cn: 您也可以通过拖拽到欢迎屏幕来打开项目或编辑文件。

source: You can also select the word at the caret and the expanding areas of the source code by double-clicking the target areas in the editor.
zh_cn: 您还可以通过双击编辑器中的目标区域来选择插入符处的词及在源代码中扩展区域。

source: You can also use Code | Optimize Imports to automatically optimize imports (remove unused imports, etc.).
zh_cn: 你也可以使用 Code | Optimize Imports 来自动优化导入(删除未使用的导入等)。

source: You can always get back to them by selecting Help | Productivity Guide from the menu bar.
zh_cn: 你总是可以从菜单中选择帮助|生产力指南来找回它们。

source: You can always get back to them by selecting Help | Productivity Guide on the menu bar.
zh_cn: 你总是可以从菜单中选择帮助|生产力指南来找回它们。

source: You can avoid escaping backslashes in your regular expressions.
zh_cn: 您可以避免在正则表达式中转义反斜杠。

source: You can bring forward the list of all usages of a class, method or variable across the whole project, and quickly jump to the selected usage.
zh_cn: 您可以列出类、方法或变量在整个项目中的所有使用，并快速跳转到所选的使用。

source: You can check out an entire project from a Version Control System.
zh_cn: 可以从一个版本控制系统中检出整个项目。

source: You can comment and uncomment lines and blocks of code using &shortcut:CommentByLineComment; and &shortcut:CommentByBlockComment;.
zh_cn: 你可以使用 &shortcut:CommentByLineComment; 和 &shortcut:CommentByBlockComment; 来注释/取消注释行或代码块。

source: You can comment and uncomment lines of code using &shortcut:CommentByLineComment;.
zh_cn: 你可以使用 &shortcut:CommentByLineComment; 来注释/取消注释行代码。

source: You can comment or uncomment lines and blocks of code using &shortcut:CommentByLineComment; and &shortcut:CommentByBlockComment;.
zh_cn: 你可以使用 &shortcut:CommentByLineComment; 和 &shortcut:CommentByBlockComment; 来注释/取消注释行或代码块。

source: You can commit the changes without running inspections, or you can wait until indices are built.
zh_cn: 您可以在不进行检查的情况下提交更改，也可以等待建立索引完成。

source: You can configure usage of the differences tool in the Settings dialog ( File | Settings | IDE: General: Diff options).
zh_cn: 你可以在 Settings(设置) 对话框中配置不同工具的使用 ( File | Settings | IDE: General: Diff options)。

source: You can create code constructs using statement completion.
zh_cn: 您可以使用语句补全来创建代码结构。

source: You can customize name prefixes for local variables, parameters, instance and static fields in File | Settings | Code Style.
zh_cn: 你可以在 File | Settings | Code Style 中为局部变量，参数，实例和静态字段自定义前缀。

source: You can customize the bodies of the generated blocks on the Code tab of File and Code Templates of your Settings/Preferences .
zh_cn: 您可以在 Settings/Preferences 的 File and Code Templates 的 Code 选项卡上自定义生成块的主体。

source: You can customize the bodies of the generated catch blocks on the Code tab of File | Settings | File and Code Templates.
zh_cn: 你可以在 File | Settings | File and Code Templates 的 Code 选项卡自定义生成的 catch 块的主体。

source: You can define a whole set of Cucumber scenarios using the Create Examples Section intention action.
zh_cn: 您可以使用 Create Examples Section 意向操作定义一整套 Cucumber 方案。

source: You can delete import statements for all unused packages within a file.
zh_cn: 您可以删除文件中所有未使用的包的导入语句。

source: You can delete the line at the caret simply by pressing &shortcut:EditorDeleteLine;.
zh_cn: 只需按 &shortcut:EditorDeleteLine; 即可删除插入符号处的行。

source: You can drag an external file from the Explorer or Finder, and drop it onto the Favorites tool window.
zh_cn: 您可以从 Explorer 或 Finder 拖动外部文件，并将其放在 Favorites 工具窗口中。

source: You can duplicate the line at the caret simply by pressing &shortcut:EditorDuplicate;.
zh_cn: 只需按 &shortcut:EditorDuplicate; 即可复制插入符号处的行。

source: You can easily create new classes, interfaces, packages and files by pressing &shortcut:Generate; (Edit | Insert...) in commander.
zh_cn: 你可以通过按 &shortcut:Generate; (Edit | Insert...) 轻松创建新的类，接口，包和文件。

source: You can easily make column selection by dragging your mouse pointer while keeping the Alt key pressed.
zh_cn: 按住 Alt 键的同时拖动鼠标指针，你可以轻松地进行列选择。

source: You can easily open an external file for editing, if you just drag it from the Explorer or Finder to the editor.
zh_cn: 只需将外部文件从 Explorer（资源管理器）或 Finder 中拖动到编辑器，就可以轻松打开外部文件进行编辑。

source: You can easily override the methods of the base class by pressing &shortcut:OverrideMethods; (Code | Override Methods).
zh_cn: 你可以通过按 &shortcut:OverrideMethods; (Code | Override Methods)轻松地覆写基类的方法。

source: You can easily rename your classes, methods and variables with automatic correction of all places where they are used.
zh_cn: 您可以轻松地重命名您的类，方法和变量，并自动更正所有使用它们的位置。

source: You can easily rename your local variables with automatic correction of all places where they are used.
zh_cn: 您可以轻松地重命名你的局部变量，并自动更正所有使用它们的位置。

source: You can easily select multiple fragments of text.
zh_cn: 您可以轻松选择多个文本片段。

source: You can enable it again in <a href="disable">settings</a> after setting the property to 'true'.
zh_cn: 将属性设置为 'true' 后，可以在<a href="disable">设置</a>中重新启用它。

source: You can evaluate the new version for {0} days, or buy it online.
zh_cn: 您可以评估新版本 {0} 天，或在网上购买它。

source: You can exclude any file from your project.
zh_cn: 您可以从项目中排除任何文件。

source: You can extend the list of existing live templates with your own.
zh_cn: 您可以使用自己的扩展现有代码模板的列表。

source: You can extract a method from an expression at the caret, or from a group of selected statements.
zh_cn: 您可以从插入符号处的表达式或一组选定的语句中提取方法。

source: You can gain quick access to the available tool windows: hover your mouse pointer over icon in the lower left corner of the IDE window.
zh_cn: 您可以快速访问可用的工具窗口：将鼠标指针悬停在 IDE 窗口左下角的 图标上。

source: You can get rid of the hard-coded strings: use the I18n string value intention action to extract a string and keep it as a property.
zh_cn: 您可以删除硬编码的字符串：使用 I18n string value 意图操作来提取字符串并将其保留为属性。

source: You can have a test, benchmark, copyright comment, or example function stub generated for you by the IDE.
zh_cn: 您可以拥有由 IDE 为您生成的测试，基准测试，版权注释或示例功能存根。

source: You can import settings using ''File|Import Settings''.
zh_cn: 您可以使用 ''文件|导入设置'' 来导入设置。

source: You can inline a constant or function at the caret by pressing &shortcut:Inline; (Refactor | Inline).
zh_cn: 您可以通过按 &shortcut:Inline;(Refactor | Inline)在插入符处插入常量或函数。

source: You can inline only individual method calls.
zh_cn: 只能内联单独的方法调用。

source: You can jump directly to any deeply buried file, if you press &shortcut:GotoFile;, and type just a couple of characters of the enclosing directories and file names:
zh_cn: 你可以跳转到任何深层的文件，只需按 &shortcut:GotoFile; ，然后输入几个目录或文件名的字符：

source: You can mark them as ignored to suppress this error notification.
zh_cn: 您可以将其标记为被忽略以禁止此错误通知。

source: You can move any file to a changelist of your choice.
zh_cn: 您可以将任何文件移动到您选择的更改列表。

source: You can navigate through different file versions, see the differences and roll back to any previous version.
zh_cn: 您可以浏览不同的文件版本，查看差异并回滚到任何以前的版本。

source: You can navigate to an interface implemented by a struct at the caret by pressing &shortcut:ShowIntentionActions; and choosing the corresponding intention action.
zh_cn: 您可以按 &shortcut:ShowIntentionActions; 并选择相应的意向操作，导航到由插入符处的结构实现的接口。

source: You can only i18nize Java string literal or substring thereof.
zh_cn: 您只能国际化 Java 字符串文字或其子字符串。

source: You can open any file in your project in a similar way by using &shortcut:GotoFile; (Navigate | File)
zh_cn: 你可以用类似的方法，使用 &shortcut:GotoFile; (Navigate | File)打开项目中的任何文件。

source: You can opt to:
zh_cn: 你可以选择：

source: You can organize breakpoints into groups, to mark out breakpoints for a specific problem.
zh_cn: 您可以将断点组织成组，以标记特定问题的断点。

source: You can preview HTML files in a browser of your choice by clicking the browser icons toolbar:
zh_cn: 您可以通过单击浏览器图标工具栏在您选择的浏览器中预览 HTML 文件：

source: You can quickly extract an expression at the caret as a variable, by pressing &shortcut:IntroduceVariable; (Refactor | Extract | Variable).
zh_cn: 通过按 &shortcut:IntroduceVariable;(Refactor | Extract | Variable)，可以快速提取插入符号中的表达式作为变量。

source: You can quickly find a setting you need in the Settings/Preferences dialog, without browsing through the numerous options.
zh_cn: 你可以在 Settings/Preferences 对话框中快速找到所需设置，而无需浏览众多选项。

source: You can quickly find all places where a particular class, method or variable is used in the whole project by positioning the caret at the symbol's name or at its usage in code and pressing &shortcut:FindUsages; (Edit | Find | Find Usages in the popup menu).
zh_cn: 你可以很快地找到特定类，方法或变量在整个项目中的所有使用，只需将插入符号定位于符号的名字处或代码中的使用处，然后按 &shortcut:FindUsages; (Edit | Find | Find Usages )。

source: You can quickly find all places where a particular class, method or variable is used in the whole project by positioning the caret at the symbol's name or at its usage in code and pressing &shortcut:FindUsages; (Find Usages in the popup menu).
zh_cn: 你可以很快地找到特定类，方法或变量在整个项目中的所有使用，只需将插入符号定位于符号的名字处或代码中的使用处，然后按 &shortcut:FindUsages; (弹窗中的 Find Usages)。

source: You can quickly find an element in the commander's panel by just typing its first letters (speed search).
zh_cn: 您可以通过在命令面板中键入首字母来快速找到元素(快速搜索)。

source: You can quickly fix the indentation for the line at the caret simply by pressing &shortcut:AutoIndentLines;.
zh_cn: 只需按 &shortcut:AutoIndentLines; 即可快速修复插入符号行的缩进。

source: You can quickly format the selected code, the current file, or even an entire folder by pressing &shortcut:ReformatCode; (Code | Reformat Code).
zh_cn: 您可以通过按下 &shortcut:ReformatCode;(Code | Reformat Code)快速格式化所选代码，当前文件或整个文件夹。

source: You can quickly get familiar with the main features of the IDE by reading these tips.
zh_cn: 您可以通过阅读这些技巧来快速了解 IDE 的主要功能。

source: You can quickly navigate from a test to the type or function being tested, and back, by pressing &shortcut:GotoTest; (Navigate | Test Subject).
zh_cn: 您可以通过按 &shortcut:GotoTest;(Navigate | Test Subject)从测试快速导航到正在测试的类型或功能，以及返回。

source: You can quickly navigate in the currently edited file with &shortcut:FileStructurePopup; (Navigate | File Structure).
zh_cn: 通过 &shortcut:FileStructurePopup; (Navigate | File Structure)，你可以在当前编辑的文件快速导航。

source: You can quickly open a Maven project by selecting a pom.xml file in the File | Open dialog.
zh_cn: 在 File | Open 对话框中选择一个 pom.xml 文件来快速打开 Maven 项目。

source: You can quickly open an Eclipse project by selecting a .classpath or .project file in the File | Open dialog.
zh_cn: 你可以在 File | Open 对话框中选择一个 .classpath 或 .project 文件，来快速打开一个 Eclipse 项目。

source: You can quickly review all styles currently applied to an HTML tag, by right-clicking the tag name and selecting Show Applied Styles For Tag from the context menu:
zh_cn: 你可以快速查看应用于 HTML 标签的所有样式，只需右击标签名字，然后从上下文菜单中选择 Show Applied Styles For Tag ：

source: You can quickly view the image referenced at caret by using the Quick Definition (&shortcut:QuickImplementations;).
zh_cn: 你可以使用 Quick Definition (&shortcut:QuickImplementations;)来快速查看插入符号处的图片引用。

source: You can remove them from the project (no files will be deleted).
zh_cn: 您可以将它们从项目中移除(不会删除任何文件)。

source: You can rename any field, function, type, variable, package, or any other symbol at the caret by pressing &shortcut:RenameElement; (Refactor | Rename).
zh_cn: 您可以通过按 &shortcut:RenameElement;(Refactor | Rename)重命名插入符号中的任何字段，函数，类型，变量，包或任何其他符号。

source: You can replace special characters in the XML or HTML files with their ASCII values that start with an apostrophe.
zh_cn: 您可以使用以撇号开头的 ASCII 值替换 XML 或 HTML 文件中的特殊字符。

source: You can significantly improve the performance, if you exclude certain folders from the antivirus protection.
zh_cn: 如果从防病毒保护中排除某些文件夹，您可以显着提高性能。

source: You can simplify editing of your regular expressions.
zh_cn: 您可以简化正则表达式的编辑。

source: You can simply apply differences between panes, by clicking one of these chevron buttons.
zh_cn: 你可以通过点击 chevron 按钮之一来简单地应用窗格中的差异。

source: You can start referring to an Ant property or target even if it is not defined yet.
zh_cn: 即使尚未定义，也可以引用 Ant 属性或目标。

source: You can switch between sorting completion variants by relevance or alphabetically by using an icon at the bottom right:
zh_cn: 你可以使用右下角的图标，来切换补全变量按相关性或字母顺序排列。
